/* automatically generated by rust-bindgen 0.72.0 */

#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

use jni_sys::*;
use windows_sys::Win32::Foundation::HWND;
use windows_sys::Win32::Graphics::Gdi::{HBITMAP, HDC, HPALETTE};

pub const JAWT_LOCK_ERROR: u32 = 1;
pub const JAWT_LOCK_CLIP_CHANGED: u32 = 2;
pub const JAWT_LOCK_BOUNDS_CHANGED: u32 = 4;
pub const JAWT_LOCK_SURFACE_CHANGED: u32 = 8;
pub const JAWT_VERSION_1_3: u32 = 65539;
pub const JAWT_VERSION_1_4: u32 = 65540;
pub const JAWT_VERSION_1_7: u32 = 65543;
pub const JAWT_VERSION_9: u32 = 589824;
#[repr(C)]
pub struct jawt_Rectangle {
    pub x: jint,
    pub y: jint,
    pub width: jint,
    pub height: jint,
}
#[test]
fn bindgen_test_layout_jawt_Rectangle() {
    const UNINIT: ::core::mem::MaybeUninit<jawt_Rectangle> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<jawt_Rectangle>(),
        16usize,
        "Size of jawt_Rectangle"
    );
    assert_eq!(
        ::core::mem::align_of::<jawt_Rectangle>(),
        4usize,
        "Alignment of jawt_Rectangle"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_Rectangle::x"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        "Offset of field: jawt_Rectangle::y"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        "Offset of field: jawt_Rectangle::width"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        12usize,
        "Offset of field: jawt_Rectangle::height"
    );
}
pub type JAWT_Rectangle = jawt_Rectangle;
#[repr(C)]
pub struct jawt_DrawingSurfaceInfo {
    pub platformInfo: *mut ::core::ffi::c_void,
    pub ds: *mut jawt_DrawingSurface,
    pub bounds: JAWT_Rectangle,
    pub clipSize: jint,
    pub clip: *mut JAWT_Rectangle,
}
#[test]
fn bindgen_test_layout_jawt_DrawingSurfaceInfo() {
    const UNINIT: ::core::mem::MaybeUninit<jawt_DrawingSurfaceInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<jawt_DrawingSurfaceInfo>(),
        48usize,
        "Size of jawt_DrawingSurfaceInfo"
    );
    assert_eq!(
        ::core::mem::align_of::<jawt_DrawingSurfaceInfo>(),
        8usize,
        "Alignment of jawt_DrawingSurfaceInfo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).platformInfo) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_DrawingSurfaceInfo::platformInfo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ds) as usize - ptr as usize },
        8usize,
        "Offset of field: jawt_DrawingSurfaceInfo::ds"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bounds) as usize - ptr as usize },
        16usize,
        "Offset of field: jawt_DrawingSurfaceInfo::bounds"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clipSize) as usize - ptr as usize },
        32usize,
        "Offset of field: jawt_DrawingSurfaceInfo::clipSize"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clip) as usize - ptr as usize },
        40usize,
        "Offset of field: jawt_DrawingSurfaceInfo::clip"
    );
}
pub type JAWT_DrawingSurfaceInfo = jawt_DrawingSurfaceInfo;
#[repr(C)]
pub struct jawt_DrawingSurface {
    pub env: *mut JNIEnv,
    pub target: jobject,
    pub Lock: ::core::option::Option<unsafe extern "C" fn(ds: *mut jawt_DrawingSurface) -> jint>,
    pub GetDrawingSurfaceInfo: ::core::option::Option<
        unsafe extern "C" fn(ds: *mut jawt_DrawingSurface) -> *mut JAWT_DrawingSurfaceInfo,
    >,
    pub FreeDrawingSurfaceInfo:
        ::core::option::Option<unsafe extern "C" fn(dsi: *mut JAWT_DrawingSurfaceInfo)>,
    pub Unlock: ::core::option::Option<unsafe extern "C" fn(ds: *mut jawt_DrawingSurface)>,
}
#[test]
fn bindgen_test_layout_jawt_DrawingSurface() {
    const UNINIT: ::core::mem::MaybeUninit<jawt_DrawingSurface> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<jawt_DrawingSurface>(),
        48usize,
        "Size of jawt_DrawingSurface"
    );
    assert_eq!(
        ::core::mem::align_of::<jawt_DrawingSurface>(),
        8usize,
        "Alignment of jawt_DrawingSurface"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).env) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_DrawingSurface::env"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        8usize,
        "Offset of field: jawt_DrawingSurface::target"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        16usize,
        "Offset of field: jawt_DrawingSurface::Lock"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GetDrawingSurfaceInfo) as usize - ptr as usize },
        24usize,
        "Offset of field: jawt_DrawingSurface::GetDrawingSurfaceInfo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FreeDrawingSurfaceInfo) as usize - ptr as usize },
        32usize,
        "Offset of field: jawt_DrawingSurface::FreeDrawingSurfaceInfo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Unlock) as usize - ptr as usize },
        40usize,
        "Offset of field: jawt_DrawingSurface::Unlock"
    );
}
pub type JAWT_DrawingSurface = jawt_DrawingSurface;
#[repr(C)]
pub struct jawt {
    pub version: jint,
    pub GetDrawingSurface: ::core::option::Option<
        unsafe extern "C" fn(env: *mut JNIEnv, target: jobject) -> *mut JAWT_DrawingSurface,
    >,
    pub FreeDrawingSurface:
        ::core::option::Option<unsafe extern "C" fn(ds: *mut JAWT_DrawingSurface)>,
    pub Lock: ::core::option::Option<unsafe extern "C" fn(env: *mut JNIEnv)>,
    pub Unlock: ::core::option::Option<unsafe extern "C" fn(env: *mut JNIEnv)>,
    pub GetComponent: ::core::option::Option<
        unsafe extern "C" fn(env: *mut JNIEnv, platformInfo: *mut ::core::ffi::c_void) -> jobject,
    >,
    #[doc = " Since 9\n Creates a java.awt.Frame placed in a native container. Container is\n referenced by the native platform handle. For example on Windows this\n corresponds to an HWND. For other platforms, see the appropriate\n machine-dependent header file for a description. The reference returned\n by this function is a local reference that is only valid in this\n environment. This function returns a NULL reference if no frame could be\n created with matching platform information."]
    pub CreateEmbeddedFrame: ::core::option::Option<
        unsafe extern "C" fn(env: *mut JNIEnv, platformInfo: *mut ::core::ffi::c_void) -> jobject,
    >,
    #[doc = " Since 9\n Moves and resizes the embedded frame. The new location of the top-left\n corner is specified by x and y parameters relative to the native parent\n component. The new size is specified by width and height.\n\n The embedded frame should be created by CreateEmbeddedFrame() method, or\n this function will not have any effect.\n\n java.awt.Component.setLocation() and java.awt.Component.setBounds() for\n EmbeddedFrame really don't move it within the native parent. These\n methods always locate the embedded frame at (0, 0) for backward\n compatibility. To allow moving embedded frames this method was\n introduced, and it works just the same way as setLocation() and\n setBounds() for usual, non-embedded components.\n\n Using usual get/setLocation() and get/setBounds() together with this new\n method is not recommended."]
    pub SetBounds: ::core::option::Option<
        unsafe extern "C" fn(
            env: *mut JNIEnv,
            embeddedFrame: jobject,
            x: jint,
            y: jint,
            w: jint,
            h: jint,
        ),
    >,
    #[doc = " Since 9\n Synthesize a native message to activate or deactivate an EmbeddedFrame\n window depending on the value of parameter doActivate, if \"true\"\n activates the window; otherwise, deactivates the window.\n\n The embedded frame should be created by CreateEmbeddedFrame() method, or\n this function will not have any effect."]
    pub SynthesizeWindowActivation: ::core::option::Option<
        unsafe extern "C" fn(env: *mut JNIEnv, embeddedFrame: jobject, doActivate: jboolean),
    >,
}
#[test]
fn bindgen_test_layout_jawt() {
    const UNINIT: ::core::mem::MaybeUninit<jawt> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::core::mem::size_of::<jawt>(), 72usize, "Size of jawt");
    assert_eq!(::core::mem::align_of::<jawt>(), 8usize, "Alignment of jawt");
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt::version"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GetDrawingSurface) as usize - ptr as usize },
        8usize,
        "Offset of field: jawt::GetDrawingSurface"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FreeDrawingSurface) as usize - ptr as usize },
        16usize,
        "Offset of field: jawt::FreeDrawingSurface"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        24usize,
        "Offset of field: jawt::Lock"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Unlock) as usize - ptr as usize },
        32usize,
        "Offset of field: jawt::Unlock"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GetComponent) as usize - ptr as usize },
        40usize,
        "Offset of field: jawt::GetComponent"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CreateEmbeddedFrame) as usize - ptr as usize },
        48usize,
        "Offset of field: jawt::CreateEmbeddedFrame"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SetBounds) as usize - ptr as usize },
        56usize,
        "Offset of field: jawt::SetBounds"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SynthesizeWindowActivation) as usize - ptr as usize },
        64usize,
        "Offset of field: jawt::SynthesizeWindowActivation"
    );
}
pub type JAWT = jawt;
extern "C" {
    #[cfg(feature = "static-get-awt")]
    pub fn JAWT_GetAWT(env: *mut JNIEnv, awt: *mut JAWT) -> jboolean;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct jawt_Win32DrawingSurfaceInfo {
    pub __bindgen_anon_1: jawt_Win32DrawingSurfaceInfo__bindgen_ty_1,
    pub hdc: HDC,
    pub hpalette: HPALETTE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union jawt_Win32DrawingSurfaceInfo__bindgen_ty_1 {
    pub hwnd: HWND,
    pub hbitmap: HBITMAP,
    pub pbits: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_jawt_Win32DrawingSurfaceInfo__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<jawt_Win32DrawingSurfaceInfo__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<jawt_Win32DrawingSurfaceInfo__bindgen_ty_1>(),
        8usize,
        "Size of jawt_Win32DrawingSurfaceInfo__bindgen_ty_1"
    );
    assert_eq!(
        ::core::mem::align_of::<jawt_Win32DrawingSurfaceInfo__bindgen_ty_1>(),
        8usize,
        "Alignment of jawt_Win32DrawingSurfaceInfo__bindgen_ty_1"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hwnd) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_Win32DrawingSurfaceInfo__bindgen_ty_1::hwnd"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hbitmap) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_Win32DrawingSurfaceInfo__bindgen_ty_1::hbitmap"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pbits) as usize - ptr as usize },
        0usize,
        "Offset of field: jawt_Win32DrawingSurfaceInfo__bindgen_ty_1::pbits"
    );
}
#[test]
fn bindgen_test_layout_jawt_Win32DrawingSurfaceInfo() {
    const UNINIT: ::core::mem::MaybeUninit<jawt_Win32DrawingSurfaceInfo> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<jawt_Win32DrawingSurfaceInfo>(),
        24usize,
        "Size of jawt_Win32DrawingSurfaceInfo"
    );
    assert_eq!(
        ::core::mem::align_of::<jawt_Win32DrawingSurfaceInfo>(),
        8usize,
        "Alignment of jawt_Win32DrawingSurfaceInfo"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdc) as usize - ptr as usize },
        8usize,
        "Offset of field: jawt_Win32DrawingSurfaceInfo::hdc"
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpalette) as usize - ptr as usize },
        16usize,
        "Offset of field: jawt_Win32DrawingSurfaceInfo::hpalette"
    );
}
pub type JAWT_Win32DrawingSurfaceInfo = jawt_Win32DrawingSurfaceInfo;
